Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 16000)]              0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 49, 20)               0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens (1, 49, 20, 1)            0         
_________________________________________________________________
stream (Stream)              (1, 47, 18, 16)           160       
_________________________________________________________________
stream_1 (Stream)            (1, 43, 16, 16)           3856      
_________________________________________________________________
reshape (Reshape)            (1, 43, 256)              0         
_________________________________________________________________
gru_1 (GRU)                  (1, 1, 256)               394752    
_________________________________________________________________
stream_2 (Stream)            (1, 256)                  0         
_________________________________________________________________
dropout (Dropout)            (1, 256)                  0         
_________________________________________________________________
dense (Dense)                (1, 128)                  32896     
_________________________________________________________________
dense_1 (Dense)              (1, 256)                  33024     
_________________________________________________________________
dense_2 (Dense)              (1, 4)                    1028      
=================================================================
Total params: 465,716
Trainable params: 465,716
Non-trainable params: 0
_________________________________________________________________