Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_audio (InputLayer)        [(1, 320)]           0                                            
__________________________________________________________________________________________________
speech_features (SpeechFeatures (1, 1, 20)           0           input_audio[0][0]                
__________________________________________________________________________________________________
tf_op_layer_ExpandDims (TensorF (1, 1, 20, 1)        0           speech_features[0][0]            
__________________________________________________________________________________________________
stream (Stream)                 (1, 1, 18, 16)       160         tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
stream_1 (Stream)               (1, 1, 16, 16)       3856        stream[0][0]                     
__________________________________________________________________________________________________
reshape (Reshape)               (1, 1, 256)          0           stream_1[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/Squ [(1, 256)]           0           reshape[0][0]                    
__________________________________________________________________________________________________
gru_1input_state (InputLayer)   [(1, 256)]           0                                            
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 768)]           0           tf_op_layer_streaming/gru_1/Squee
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 768)]           0           gru_1input_state[0][0]           
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 768)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 768)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256), (1, 256), 0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256), (1, 256), 0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
gru_1 (GRU)                     (1, 1, 256)          394752      reshape[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
stream_2 (Stream)               (1, 256)             0           gru_1[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
dropout (Dropout)               (1, 256)             0           stream_2[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
dense (Dense)                   (1, 128)             32896       dropout[0][0]                    
__________________________________________________________________________________________________
data_frame_1input_state (InputL [(1, 640)]           0                                            
__________________________________________________________________________________________________
lambda_8 (Lambda)               (1, 320)             0           input_audio[0][0]                
__________________________________________________________________________________________________
stream/ExternalState (InputLaye [(1, 3, 20, 1)]      0                                            
__________________________________________________________________________________________________
stream_1/ExternalState (InputLa [(1, 5, 18, 16)]     0                                            
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
stream_2/ExternalState (InputLa [(1, 1, 256)]        0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (1, 256)             33024       dense[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_streaming/speech_fe [(1, 320)]           0           data_frame_1input_state[0][0]    
__________________________________________________________________________________________________
lambda_7 (Lambda)               (1, 320)             0           lambda_8[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/st [(1, 2, 20, 1)]      0           stream/ExternalState[0][0]       
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_1/ [(1, 4, 18, 16)]     0           stream_1/ExternalState[0][0]     
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 gru_1input_state[0][0]           
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_2/ [(1, 0, 256)]        0           stream_2/ExternalState[0][0]     
__________________________________________________________________________________________________
dense_2 (Dense)                 (1, 4)               1028        dense_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_streaming/speech_fe [(1, 640)]           0           tf_op_layer_streaming/speech_feat
                                                                 lambda_7[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_streaming/stream/co [(1, 3, 20, 1)]      0           tf_op_layer_streaming/stream/stri
                                                                 tf_op_layer_ExpandDims[0][0]     
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_1/ [(1, 5, 18, 16)]     0           tf_op_layer_streaming/stream_1/st
                                                                 stream[0][0]                     
__________________________________________________________________________________________________
tf_op_layer_streaming/gru_1/cel [(1, 256)]           0           tf_op_layer_streaming/gru_1/cell/
                                                                 tf_op_layer_streaming/gru_1/cell/
__________________________________________________________________________________________________
tf_op_layer_streaming/stream_2/ [(1, 1, 256)]        0           tf_op_layer_streaming/stream_2/st
                                                                 gru_1[0][0]                      
==================================================================================================
Total params: 465,716
Trainable params: 465,716
Non-trainable params: 0
__________________________________________________________________________________________________